app/views/users/show.html.erb

SELECT  1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
<div>
	<% if @user.posts.any? %>