app/views/posts/_post.html.erb

<li id="post-<%= post.id %>">
  <strong><span class="user"><%= link_to post.user.first, post.user %></span></strong>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]