app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <% user = @post.user %>
  <strong><%= link_to @post.user.first, user %>