app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "First one"], ["body", "first one since final design"], ["created_at", 2016-09-11 09:43:48 UTC], ["updated_at", 2016-09-11 09:43:48 UTC], ["user_id", 1]]
---
  def create
    @post = current_user.posts.build(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["user_id", 1], ["updated_at", 2016-09-07 03:10:59 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)