app/controllers/users_controller.rb

INSERT INTO "users" ("first", "last", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first", "KIM"], ["last", "PHAM"], ["email", "pghkim94@gmail.com"], ["created_at", 2016-09-07 02:49:20 UTC], ["updated_at", 2016-09-07 02:49:20 UTC]]
---
  def create
    @user = User.new(user_params)
    respond_to do |format|
      if @user.save